#!/usr/bin/env python3
# -*- coding: utf-8 -*-

#####################################################
#开头加上以上的注释是为了说明
#第一行注释是为了告诉Linux/OS X系统，这是一个Python可执行程序，Windows系统会忽略这个注释；
#第二行注释是为了告诉Python解释器，按照UTF-8编码读取源代码
######################################################

#print('测试中文输出是否正常')


#####################
###格式化输出字符串
######################

#print('%s,你收到一封新邮件,请查收!' % 'kui');
#print('%s，你这个月的通讯费为%f'% ('mary',123.23))
#rint('通过输入%%.2f,可实现控制小数位输出 %.2f ' % 123.4567)

###
# %s  字符串转换
# %d  整数转换
# %f  浮点型转换
# %x  十六进制整数
###



i=85
j=100
print('小明第一次考试%s分,第二次开始%s分' % (i,j))
print('相比第一次考试进步了%.2f%%' % ((100-85)/85*100))
